{"inkVersion":20,"root":[["\n",{"->":"introduction.start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"introduction":[{"->":".^.start"},{"start":[["^As your eyes open, a splitting pain ignites right where your brain should be - which was reassuring in that it at least suggested you still had one.","\n","^Sweeping your view up from straw bedding in which you currently preside, you finally notice an old man leaning against the far wall","\n","^\"Awake now, finally, huh?\" he says in a gravelly voice.","\n","ev","str","^Cough","/str","/ev",{"*":".^.c-0","flg":20},["ev",{"^->":"introduction.start.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"Bleh, where am I?\"",{"->":"$r","var":true},null]}],{"c-0":["^ You try the speak but your throat is so dry.","\n",{"->":".^.^.^.^.dry_throat"},{"#f":5}],"c-1":["ev",{"^->":"introduction.start.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],"^ you reply hoarsely","\n",{"->":".^.^.^.^.start_explaining"},{"#f":5}]}],{"#f":1}],"dry_throat":[["^Finding a half-depleted water skin by your side, you take a few frantic gulps.","\n","^You can feel the water flow down your parched throat and rejuvinate your airways, and begin to breath deeply just as you register the stale rancid flavour of what you just drank. You swallow again and hope for the best","\n",["ev",{"^->":"introduction.dry_throat.0.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Where am I?\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"introduction.dry_throat.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"^ you mutter through gritted teeth ","\n",{"->":".^.^.^.^.start_explaining"},{"#f":5}]}],{"#f":1}],"start_explaining":["^\"Hit you that hard, did they?\" The old man chuckles in response to your question.","\n","^Responding to your blank stare, he continues: \"You're presently as his lordships's pleasure. Yes, -that- lordship\".","\n","^\"I presume they rounded you up off the street? Don't you remember anything?\"","\n",{"->":".^.^.recall1"},{"#f":1}],"recall1":[["ev","str","^Blink, blankly","/str","/ev",{"*":".^.c-0","flg":20},["ev",{"^->":"introduction.recall1.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^\"I think I remember fighting some thugs...\"",{"->":"$r","var":true},null]}],["ev",{"^->":"introduction.recall1.0.7.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^Recollection surges forth, and your eye open wide",{"->":"$r","var":true},null]}],{"c-0":["\n","^Clearly, despite the earlier evidence suggesting your brain still existed, what was there wasn't pulling its weight.","\n","^Breathing gently for a few moments you try to wake up your lazy brain and get it to tell you anything it might remember..","\n","^\"Hit you really hard then ...\" The old man mutters, clearly getting a little impatient at your poor conversation skills","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["ev",{"^->":"introduction.recall1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"^ you recall","\n","^You trail off as you try harder to summon up more of an image of what occured","\n",{"->":".^.^.^.^.recall2__from_old_man"},{"#f":5}],"c-2":["ev",{"^->":"introduction.recall1.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.7.s"},[{"#n":"$r2"}],"\n",{"->":".^.^.^.^.recall2__personal"},{"#f":5}]}],{"#f":1}],"recall2__personal":["^Your bruised and painful brain suddenly flashes images of thugs bursting into the inn, but with the benefit of hindsight you finally put 2 and 2 together and realise they weren't just \"normal\" thugs","\n","^You look up at the old man, \"Those thugs ...\"","\n",{"->":".^.^.recall2_common"},{"#f":1}],"recall2__from_old_man":["^The old man nods, slowly, adjusting his stance against the wall","\n",{"->":".^.^.recall2_common"},{"#f":1}],"recall2_common":[["^\"Those thugs weren't just normal thugs. If you'd had a chance to look closer you'd have noticed a conspicuous scratched up blank patch on their leather tunics.\"","\n","^The realisation sinks in now, and the pain behind your eyes flares again in empathy.","\n","^The old man appears to notice your reaction and sighs heavily. \"Yep, that wasn't just random violence, that was a coup by Lord Greywick - in whose dungeons we currently reside...\"","\n","ev","str","^Gape idly","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Rub your forehead","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ You gape idly at him, waiting for him to keep explaining what the hell is going on","\n",{"->":".^.^.^.^.recall3"},{"#f":5}],"c-1":["^ The pain in your head is not going away, and you rub your forehead and massage your temples as you listen to this man","\n",{"->":".^.^.^.^.recall3"},{"#f":5}]}],{"#f":1}],"recall3":[["^He finally steps away from the wall for the first time and moves towards you.","\n","^This gives you a chance to finally get a proper look at him. He's not as old as your previously thought - though his face is weather-worn, wrinkled, and scarred. Wearing loose fitting leathers, the body hidden beneath seems strong and agile as he moves.","\n","^\"Anyway,\" he says, sounding more chipper than before, \"I know why he dragged *me* back to his cells, but I'd love to know why you made the cut too\".","\n",["ev",{"^->":"introduction.recall3.0.6.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^\"Uh... I...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"introduction.recall3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.6.s"},[{"#n":"$r2"}],"^ you stammer.","\n",{"->":".^.^.^.^.break_out_starts"},{"#f":5}]}],{"#f":1}],"break_out_starts":[["^At your dumb response, the man squints his eyes and looks thoughtful for a second - before suddenly turning to look out the tiny iron-barred window.","\n","^\"Well it doesn't matter and, luckily for you, I made some plans in advance...\" he tails off, still staring at the window.","\n","ev","str","^Stand up, and walk toward the window","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Sit up and turn towards the window","/str","/ev",{"*":".^.c-1","flg":20},["ev",{"^->":"introduction.break_out_starts.0.16.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^\"What's so special about you?\"",{"->":"$r","var":true},null]}],{"c-0":["^ You stand, unsteadily, from the straw matress that had supported your for, up till now.","\n",{"->":".^.^.^.^.stand_up"},{"#f":5}],"c-1":["^ You sit up properly, and turn to follow the man's gaze towards the window.","\n",{"->":".^.^.^.^.package_arrives"},{"#f":5}],"c-2":["ev",{"^->":"introduction.break_out_starts.0.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.16.s"},[{"#n":"$r2"}],"^ you mutter, accusingly.","\n","^\"Ah, you may find out.\" the man says in response to your question, grinning slightly, but not taking his eyes off the window.","\n","^Before you can press for him to explain himself... ",{"->":".^.^.^.^.package_arrives"},"\n",{"#f":5}]}],{"#f":1}],"stand_up":["^You stand up, legs and arms arching from strain and blows forgotten. The dusty straw matress seems to crumble beneath the pressure of your hands, some insects scuttle for safety which you choose to ignore, and eventually you are mostly upright and propped.","\n","^With more effort than you'd like to admit, you turn your shoulders and head to point at the window which was now the sole interest of your cell-mate.","\n",{"->":".^.^.package_arrives"},{"#f":1}],"package_arrives":["^Sailing  smoothly through the air, then thudding between the bars in the the window, a small leather pouch arrives in the room. The old man steps swiftly, much more deftly than he had first appeared capable, forward and catches it as it falls.","\n","^Looking up and winking at you, he quickly unties the bag draw-string and removes from it several items: A small knife, a bundle of thin, hooked metal strips, a tiny glass vial containing a pearlescent blue liquid, and a gold signet ring.","\n","^He slips the ring onto his finger, putting the potion and knife in his pocket, before softly walking toward the cell door.","\n","done",{"#f":1}],"#f":1}],"escape1":["^forgotten","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}